## staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `aws_ses_domain_dkim.notification-canada-ca`                                 |
|        | `aws_ses_domain_dkim.notification-canada-ca-receiving`                       |
|        | `aws_ses_domain_mail_from.notification-canada-ca`                            |
|        | `aws_ses_identity_notification_topic.notification-canada-ca-bounce-topic`    |
|        | `aws_ses_identity_notification_topic.notification-canada-ca-complaint-topic` |
|        | `aws_ses_identity_notification_topic.notification-canada-ca-delivery-topic`  |
|        | `aws_sesv2_email_identity.notification-canada-ca`                            |
|        | `aws_sesv2_email_identity.notification-canada-ca-receiving`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ses_domain_dkim.notification-canada-ca will be created
  + resource "aws_ses_domain_dkim" "notification-canada-ca" {
      + dkim_tokens = (known after apply)
      + domain      = "staging.notification.cdssandbox.xyz"
      + id          = (known after apply)
    }

  # aws_ses_domain_dkim.notification-canada-ca-receiving will be created
  + resource "aws_ses_domain_dkim" "notification-canada-ca-receiving" {
      + dkim_tokens = (known after apply)
      + domain      = "staging.notification.cdssandbox.xyz"
      + id          = (known after apply)
    }

  # aws_ses_domain_mail_from.notification-canada-ca will be created
  + resource "aws_ses_domain_mail_from" "notification-canada-ca" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "staging.notification.cdssandbox.xyz"
      + id                     = (known after apply)
      + mail_from_domain       = "bounce.staging.notification.cdssandbox.xyz"
    }

  # aws_ses_identity_notification_topic.notification-canada-ca-bounce-topic will be created
  + resource "aws_ses_identity_notification_topic" "notification-canada-ca-bounce-topic" {
      + id                       = (known after apply)
      + identity                 = "staging.notification.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Bounce"
      + topic_arn                = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # aws_ses_identity_notification_topic.notification-canada-ca-complaint-topic will be created
  + resource "aws_ses_identity_notification_topic" "notification-canada-ca-complaint-topic" {
      + id                       = (known after apply)
      + identity                 = "staging.notification.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Complaint"
      + topic_arn                = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # aws_ses_identity_notification_topic.notification-canada-ca-delivery-topic will be created
  + resource "aws_ses_identity_notification_topic" "notification-canada-ca-delivery-topic" {
      + id                       = (known after apply)
      + identity                 = "staging.notification.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Delivery"
      + topic_arn                = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # aws_sesv2_email_identity.notification-canada-ca will be created
  + resource "aws_sesv2_email_identity" "notification-canada-ca" {
      + arn                         = (known after apply)
      + email_identity              = "staging.notification.cdssandbox.xyz"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.notification-canada-ca-receiving will be created
  + resource "aws_sesv2_email_identity" "notification-canada-ca-receiving" {
      + arn                         = (known after apply)
      + email_identity              = "staging.notification.cdssandbox.xyz"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ dkim_verification_token               = [
      - "pdwp5bpdniz7y4bxnzbt7xasc6fckptw",
      - "m2raeckpszs5h6xfta55h6g6oqilfsdc",
      - "njevscghzshjlnp537wl47birs6fqwb6",
    ] -> (known after apply)
  ~ notification_canada_ca_dkim           = [
      - "pdwp5bpdniz7y4bxnzbt7xasc6fckptw",
      - "m2raeckpszs5h6xfta55h6g6oqilfsdc",
      - "njevscghzshjlnp537wl47birs6fqwb6",
    ] -> (known after apply)
  ~ notification_canada_ca_receiving_dkim = [
      - "tsvsmtkqb2eu3kyzgwrfss6m5bolgt27",
      - "24r7lbzb7spnkryfm7m4qovy4blgvuf2",
      - "tgwhvv4xwphbfvz7kvjtgwr7rgghpcxy",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"custom-sending-domain.staging.notification.cdssandbox.xyz\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
